In [1]:
import pandas as pd
import datetime as dt
import numpy as np

In [2]:
# Create import paths

sales_path="Resources/sales-data-set.csv"
stores_path="Resources/stores-data-set.csv"

In [3]:
# Read Stores data

stores_df = pd.read_csv(stores_path)
stores_df.head()

   Store Type    Size
0      1    A  151315
1      2    A  202307
2      3    B   37392
3      4    A  205863
4      5    B   34875

In [4]:
# Read Sales data

sales_df = pd.read_csv(sales_path)
sales_df.head()

   Store  Dept        Date  Weekly_Sales  IsHoliday
0      1     1  05/02/2010      24924.50      False
1      1     1  12/02/2010      46039.49       True
2      1     1  19/02/2010      41595.55      False
3      1     1  26/02/2010      19403.54      False
4      1     1  05/03/2010      21827.90      False

In [5]:
# Get dtypes

sales_df.dtypes

Store             int64
Dept              int64
Date             object
Weekly_Sales    float64
IsHoliday          bool
dtype: object

In [6]:
# Convert Date to Datetime object

sales_df["Date"] = pd.to_datetime(sales_df["Date"])
sales_df.sort_values(by=["Store"], inplace=True)
sales_df

        Store  Dept       Date  Weekly_Sales  IsHoliday
0           1     1 2010-05-02      24924.50      False
6825        1    56 2010-10-15       1555.96      False
6826        1    56 2010-10-22       1452.08      False
6827        1    56 2010-10-29       1395.02      False
6828        1    56 2010-05-11       1089.72      False
...       ...   ...        ...           ...        ...
415146     45    24 2011-07-10       7858.31      False
415147     45    24 2011-10-14       3573.52      False
415148     45    24 2011-10-21       6275.41      False
415150     45    24 2011-04-11       7457.26      False
421569     45    98 2012-10-26       1076.80      False

[421570 rows x 5 columns]

In [7]:
# Drop Department and IsHoliday columns

sales_df = sales_df.drop(["Dept", "IsHoliday"], axis=1)
sales_df

        Store       Date  Weekly_Sales
0           1 2010-05-02      24924.50
6825        1 2010-10-15       1555.96
6826        1 2010-10-22       1452.08
6827        1 2010-10-29       1395.02
6828        1 2010-05-11       1089.72
...       ...        ...           ...
415146     45 2011-07-10       7858.31
415147     45 2011-10-14       3573.52
415148     45 2011-10-21       6275.41
415150     45 2011-04-11       7457.26
421569     45 2012-10-26       1076.80

[421570 rows x 3 columns]

In [11]:
# Find values for store 1

store_1 = sales_df.loc[sales_df["Store"] == 1]
store_1_grouped = store_1.groupby(store_1.Date).sum()
store_1_grouped = store_1_grouped.drop(["Store"], axis=1)
store_1 = store_1_grouped.rename(columns = {"Weekly_Sales": "Store_1_Sales"})
store_1

            Store_1_Sales
Date
2010-01-10     1453329.50
2010-02-04     1594968.28
2010-02-07     1492418.14
2010-02-19     1611968.17
2010-02-26     1409727.59
...                   ...
2012-10-08     1592409.97
2012-10-19     1508068.77
2012-10-26     1493659.74
2012-11-05     1611096.05
2012-12-10     1573072.81

[143 rows x 1 columns]

In [12]:
# Find values for store 2

store_2 = sales_df.loc[sales_df["Store"] == 2]
store_2_grouped = store_2.groupby(store_2.Date).sum()
store_2_grouped = store_2_grouped.drop(["Store"], axis=1)
store_2 = store_2_grouped.rename(columns = {"Weekly_Sales": "Store_2_Sales"})
store_2

            Store_2_Sales
Date
2010-01-10     1827440.43
2010-02-04     2066187.72
2010-02-07     2003940.64
2010-02-19     2124451.54
2010-02-26     1865097.27
...                   ...
2012-10-08     1866719.96
2012-10-19     1847990.41
2012-10-26     1834458.35
2012-11-05     1917520.99
2012-12-10     1900745.13

[143 rows x 1 columns]